The  FabricationService  type exposes the following members.
 Methods
Name  |   Description
Dispose
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetButton
 Gets the service button for a given group index and button index from the service.
GetButtonCount
 Gets the number of buttons for a given group in the service.
GetGroupName
 Gets the name of a group based on group index.
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsGroupExcluded
 Get whether a service group is excluded from being used by the Route and Fill or Design to Fabrication commands. The default configuration values may be overridden by SetServiceGroupExclusions.
IsValidButtonIndex
 Validates the button index.
IsValidGroupIndex
 Validates the group index.
OverrideServiceButtonExclusion
 Overrides the default service button exclusions, used by Route and Fill or Design to Fabrication, for the current user and session only.
ResetServiceExclusionOverrides
 Resets the overridden service group and button exclusions back to default, as defined by the configuration.
SetServiceGroupExclusions
 Sets the service group exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those groups passed.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  FabricationService Class
  Autodesk.Revit.DB Namespace